import {makeAutoObservable} from "mobx"

export default class NewsStore {
    constructor() {
        this._news = [
          { id: 1, title: "Убили негра", text: "Ай-яй-яй-яй", isEvent: "True", date: "21.02.2002" },
          { id: 2, title: "Новая новость", text: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", isEvent: "True", date: "21.02.2002" },
          { id: 3, title: "Новая новостьНовая новостьНовая новостьНовая новостьНовая новостьНовая новость", text: "Ай-яй-яй-яй", isEvent: "True", date: "21.02.2002" },
          { id: 4, title: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", text: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", isEvent: "True", date: "21.02.2002" },
          { id: 5, title: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", text: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", isEvent: "True", date: "21.02.2002" },
          { id: 6, title: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", text: "ОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразецОбразец", isEvent: "True", date: "21.02.2002" },
        ];
        makeAutoObservable(this);
    }

    setNews(news) {
        this._news = news;
    }

    get News() {
        return this._news;
    }

}