import {makeAutoObservable} from "mobx"

export default class NewsStore {
    constructor() {
        this._news = [
          { id: 1, imageSrc: "https://cdn.fishki.net/upload/post/2019/12/27/3183208/2-16.jpg", title: "Новая новость", text: "Новая новость", isEvent: "True", date: "21.02.2002" },
          { id: 2, imageSrc: "https://cdn.fishki.net/upload/post/2019/12/27/3183208/2-16.jpg", title: "Новая новость", text: "Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость", isEvent: "True", date: "21.02.2002" },
          { id: 3, imageSrc: "https://cdn.fishki.net/upload/post/2019/12/27/3183208/2-16.jpg", title: "Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость Новая новость", text: "Ай-яй-яй-яй", isEvent: "True", date: "21.02.2002" },
          { id: 4, imageSrc: "https://cdn.fishki.net/upload/post/2019/12/27/3183208/2-16.jpg", title: "Образец Образец Образец Образец Образец Образец Образец Образец Образец", text: "Образец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец ОбразецОбразец Образец Образец Образец Образец Образец Образец Образец Образец", isEvent: "True", date: "21.02.2002" },
          { id: 5, imageSrc: "https://cdn.fishki.net/upload/post/2019/12/27/3183208/2-16.jpg", title: "Образец Образец Образец Образец Образец Образец Образец Образец Образец", text: "Образец Образец Образец Образец Образец Образец Образец Образец Образец", isEvent: "True", date: "21.02.2002" },
          { id: 6, imageSrc: "https://cdn.fishki.net/upload/post/2019/12/27/3183208/2-16.jpg", title: "Образец Образец Образец Образец Образец Образец Образец Образец Образец", text: "Образец Образец Образец Образец Образец Образец Образец Образец Образец", isEvent: "True", date: "21.02.2002" },
        ];
        makeAutoObservable(this);
    }

    setNews(news) {
        this._news = news;
    }

    get News() {
        return this._news;
    }

}